title: Scheduled Task/Job Creation
id: 7f98e81b-e912-4242-8f2d-840d5e551100
status: experimental
description: Detects the creation of scheduled tasks in user session. 

author: Emirhan KISA
date: 2024/03/26
tags:
  - attack.t1053
  - attack.s0111
  - attack.execution
  - attack.persistence
  - attack.privilege_escalation
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: 'schtasks.exe'
    CommandLine|contains: '/create'
  filter:
    User: NT AUTHORITY\SYSTEM
  condition: selection and not filter
falsepositives:
  - Administrative activity and Software installation.
level: low
